============================================================================================================================================================================================================================
Layer (type:depth-idx)                        Input Shape               Output Shape              Param #                   Param %                   Kernel Shape              Mult-Adds                 Trainable
============================================================================================================================================================================================================================
CNNHARModel                                   [1, 3, 336, 336]          [1, 15]                   --                             --                   --                        --                        False
├─Sequential: 1-1                             [1, 3, 336, 336]          [1, 512, 1, 1]            --                             --                   --                        --                        False
│    └─Conv2d: 2-1                            [1, 3, 336, 336]          [1, 64, 168, 168]         (9,408)                     0.04%                   [7, 7]                    265,531,392               False
│    └─BatchNorm2d: 2-2                       [1, 64, 168, 168]         [1, 64, 168, 168]         (128)                       0.00%                   --                        128                       False
│    └─ReLU: 2-3                              [1, 64, 168, 168]         [1, 64, 168, 168]         --                             --                   --                        --                        --
│    └─MaxPool2d: 2-4                         [1, 64, 168, 168]         [1, 64, 84, 84]           --                             --                   3                         --                        --
│    └─Sequential: 2-5                        [1, 64, 84, 84]           [1, 64, 84, 84]           --                             --                   --                        --                        False
│    │    └─BasicBlock: 3-1                   [1, 64, 84, 84]           [1, 64, 84, 84]           (73,984)                    0.34%                   --                        520,225,024               False
│    │    └─BasicBlock: 3-2                   [1, 64, 84, 84]           [1, 64, 84, 84]           (73,984)                    0.34%                   --                        520,225,024               False
│    │    └─BasicBlock: 3-3                   [1, 64, 84, 84]           [1, 64, 84, 84]           (73,984)                    0.34%                   --                        520,225,024               False
│    └─Sequential: 2-6                        [1, 64, 84, 84]           [1, 128, 42, 42]          --                             --                   --                        --                        False
│    │    └─BasicBlock: 3-4                   [1, 64, 84, 84]           [1, 128, 42, 42]          (230,144)                   1.07%                   --                        404,620,032               False
│    │    └─BasicBlock: 3-5                   [1, 128, 42, 42]          [1, 128, 42, 42]          (295,424)                   1.37%                   --                        520,225,280               False
│    │    └─BasicBlock: 3-6                   [1, 128, 42, 42]          [1, 128, 42, 42]          (295,424)                   1.37%                   --                        520,225,280               False
│    │    └─BasicBlock: 3-7                   [1, 128, 42, 42]          [1, 128, 42, 42]          (295,424)                   1.37%                   --                        520,225,280               False
│    └─Sequential: 2-7                        [1, 128, 42, 42]          [1, 256, 21, 21]          --                             --                   --                        --                        False
│    │    └─BasicBlock: 3-8                   [1, 128, 42, 42]          [1, 256, 21, 21]          (919,040)                   4.26%                   --                        404,620,800               False
│    │    └─BasicBlock: 3-9                   [1, 256, 21, 21]          [1, 256, 21, 21]          (1,180,672)                 5.48%                   --                        520,225,792               False
│    │    └─BasicBlock: 3-10                  [1, 256, 21, 21]          [1, 256, 21, 21]          (1,180,672)                 5.48%                   --                        520,225,792               False
│    │    └─BasicBlock: 3-11                  [1, 256, 21, 21]          [1, 256, 21, 21]          (1,180,672)                 5.48%                   --                        520,225,792               False
│    │    └─BasicBlock: 3-12                  [1, 256, 21, 21]          [1, 256, 21, 21]          (1,180,672)                 5.48%                   --                        520,225,792               False
│    │    └─BasicBlock: 3-13                  [1, 256, 21, 21]          [1, 256, 21, 21]          (1,180,672)                 5.48%                   --                        520,225,792               False
│    └─Sequential: 2-8                        [1, 256, 21, 21]          [1, 512, 11, 11]          --                             --                   --                        --                        False
│    │    └─BasicBlock: 3-14                  [1, 256, 21, 21]          [1, 512, 11, 11]          (3,673,088)                17.04%                   --                        444,075,008               False
│    │    └─BasicBlock: 3-15                  [1, 512, 11, 11]          [1, 512, 11, 11]          (4,720,640)                21.90%                   --                        570,951,680               False
│    │    └─BasicBlock: 3-16                  [1, 512, 11, 11]          [1, 512, 11, 11]          (4,720,640)                21.90%                   --                        570,951,680               False
│    └─AdaptiveAvgPool2d: 2-9                 [1, 512, 11, 11]          [1, 512, 1, 1]            --                             --                   --                        --                        --
├─Sequential: 1-2                             [1, 512]                  [1, 15]                   --                             --                   --                        --                        False
│    └─Dropout: 2-10                          [1, 512]                  [1, 512]                  --                             --                   --                        --                        --
│    └─Linear: 2-11                           [1, 512]                  [1, 512]                  (262,656)                   1.22%                   --                        262,656                   False
│    └─ReLU: 2-12                             [1, 512]                  [1, 512]                  --                             --                   --                        --                        --
│    └─Dropout: 2-13                          [1, 512]                  [1, 512]                  --                             --                   --                        --                        --
│    └─Linear: 2-14                           [1, 512]                  [1, 15]                   (7,695)                     0.04%                   --                        7,695                     False
============================================================================================================================================================================================================================
Total params: 21,555,023
Trainable params: 0
Non-trainable params: 21,555,023
Total mult-adds (Units.GIGABYTES): 8.38
============================================================================================================================================================================================================================
Input size (MB): 1.35
Forward/backward pass size (MB): 135.19
Params size (MB): 86.22
Estimated Total Size (MB): 222.77
============================================================================================================================================================================================================================