======================================================================================================================================================================================================================================
Layer (type:depth-idx)                                  Input Shape               Output Shape              Param #                   Param %                   Kernel Shape              Mult-Adds                 Trainable
======================================================================================================================================================================================================================================
CNNHARModel                                             [1, 3, 336, 336]          [1, 15]                   --                             --                   --                        --                        False
├─Sequential: 1-1                                       [1, 3, 336, 336]          [1, 1280, 1, 1]           --                             --                   --                        --                        False
│    └─Sequential: 2-1                                  [1, 3, 336, 336]          [1, 1280, 11, 11]         --                             --                   --                        --                        False
│    │    └─Conv2dNormActivation: 3-1                   [1, 3, 336, 336]          [1, 32, 168, 168]         (928)                       0.03%                   --                        24,385,600                False
│    │    └─InvertedResidual: 3-2                       [1, 32, 168, 168]         [1, 16, 168, 168]         (896)                       0.03%                   --                        22,579,296                False
│    │    └─InvertedResidual: 3-3                       [1, 16, 168, 168]         [1, 24, 84, 84]           (5,136)                     0.18%                   --                        65,705,904                False
│    │    └─InvertedResidual: 3-4                       [1, 24, 84, 84]           [1, 24, 84, 84]           (8,832)                     0.31%                   --                        57,916,272                False
│    │    └─InvertedResidual: 3-5                       [1, 24, 84, 84]           [1, 32, 42, 42]           (10,000)                    0.35%                   --                        34,800,832                False
│    │    └─InvertedResidual: 3-6                       [1, 32, 42, 42]           [1, 32, 42, 42]           (14,848)                    0.51%                   --                        24,725,056                False
│    │    └─InvertedResidual: 3-7                       [1, 32, 42, 42]           [1, 32, 42, 42]           (14,848)                    0.51%                   --                        24,725,056                False
│    │    └─InvertedResidual: 3-8                       [1, 32, 42, 42]           [1, 64, 21, 21]           (21,056)                    0.73%                   --                        17,019,968                False
│    │    └─InvertedResidual: 3-9                       [1, 64, 21, 21]           [1, 64, 21, 21]           (54,272)                    1.88%                   --                        23,201,792                False
│    │    └─InvertedResidual: 3-10                      [1, 64, 21, 21]           [1, 64, 21, 21]           (54,272)                    1.88%                   --                        23,201,792                False
│    │    └─InvertedResidual: 3-11                      [1, 64, 21, 21]           [1, 64, 21, 21]           (54,272)                    1.88%                   --                        23,201,792                False
│    │    └─InvertedResidual: 3-12                      [1, 64, 21, 21]           [1, 96, 21, 21]           (66,624)                    2.31%                   --                        28,620,864                False
│    │    └─InvertedResidual: 3-13                      [1, 96, 21, 21]           [1, 96, 21, 21]           (118,272)                   4.10%                   --                        51,059,712                False
│    │    └─InvertedResidual: 3-14                      [1, 96, 21, 21]           [1, 96, 21, 21]           (118,272)                   4.10%                   --                        51,059,712                False
│    │    └─InvertedResidual: 3-15                      [1, 96, 21, 21]           [1, 160, 11, 11]          (155,264)                   5.38%                   --                        36,166,784                False
│    │    └─InvertedResidual: 3-16                      [1, 160, 11, 11]          [1, 160, 11, 11]          (320,000)                  11.08%                   --                        38,220,800                False
│    │    └─InvertedResidual: 3-17                      [1, 160, 11, 11]          [1, 160, 11, 11]          (320,000)                  11.08%                   --                        38,220,800                False
│    │    └─InvertedResidual: 3-18                      [1, 160, 11, 11]          [1, 320, 11, 11]          (473,920)                  16.41%                   --                        56,806,720                False
│    │    └─Conv2dNormActivation: 3-19                  [1, 320, 11, 11]          [1, 1280, 11, 11]         (412,160)                  14.27%                   --                        49,564,160                False
│    └─AdaptiveAvgPool2d: 2-2                           [1, 1280, 11, 11]         [1, 1280, 1, 1]           --                             --                   --                        --                        --
├─Sequential: 1-2                                       [1, 1280]                 [1, 15]                   --                             --                   --                        --                        False
│    └─Dropout: 2-3                                     [1, 1280]                 [1, 1280]                 --                             --                   --                        --                        --
│    └─Linear: 2-4                                      [1, 1280]                 [1, 512]                  (655,872)                  22.71%                   --                        655,872                   False
│    └─ReLU: 2-5                                        [1, 512]                  [1, 512]                  --                             --                   --                        --                        --
│    └─Dropout: 2-6                                     [1, 512]                  [1, 512]                  --                             --                   --                        --                        --
│    └─Linear: 2-7                                      [1, 512]                  [1, 15]                   (7,695)                     0.27%                   --                        7,695                     False
======================================================================================================================================================================================================================================
Total params: 2,887,439
Trainable params: 0
Non-trainable params: 2,887,439
Total mult-adds (Units.MEGABYTES): 691.85
======================================================================================================================================================================================================================================
Input size (MB): 1.35
Forward/backward pass size (MB): 241.86
Params size (MB): 11.55
Estimated Total Size (MB): 254.77
======================================================================================================================================================================================================================================